#pragma once

tatakaimenu list[6] =
{
	{ 80,360,"たたかう" },
	{ 100,380,"じゅもん" },
	{ 100,400,"とくぎ" },
	{ 100,420,"どうぐ" },
	{ 100,440,"にげる" },
	{ 100,460,"さくせん" },
};

tatakaimenu EnemySelectMenu[3] =
{
	{220,370,""},
	{220,410,""},
	{220,450,""},
};

Enemy monster[100] =
{//      名前,画像,ナンバー,HP,ATTACK,DEFENSE,INT,SPEED,GOLD,EXP
	{ "スライム",1,1,9,50,70,10,20,2,2 },//01
	{ "スライムベス",2,2,12,50,70,10,20,3,4 },//02
	{ "ゴーレム",3,3,100,50,70,10,20,25,100 },//03
	{ "ももんじゃ",4,4,15,50,70,10,20,7,5 },//04
	{ "ひとくいばこ",5,5,70,50,70,10,20,40,70 },//05
	{ "ギガンテス",6,6,150,50,70,10,20,70,120 },//06
	{ "メタルスライム",7,7,4,50,70,10,20,10,1000 },//07
};
int monsterpic[7];
Enemy MonsterCopyData[3];

MainCharacter Hero[1] =
{
	{ "主人公",100,100,1,10,30,40,50,0 },
};

